#Linux 教程

#本教程针对的是Linux服务器方面的知识，适合从事运维或后端开发的人员阅读。
#需要具备的知识？
#如果你熟悉操作系统方面的知识，相信你会很快学会 Linux。
#本教程将于 Linux 的发行版本 Centos 为例来为大家介绍 Linux 系统的应用。

#Linux 简介
#Linux 内核最初只是由芬兰人林纳斯·托瓦兹（Linus Torvalds）在赫尔辛基大学上学时出于个人爱好而编写的。
#Linux 是一套免费使用和自由传播的类 Unix 操作系统，
#是一个基于 POSIX 和 UNIX 的多用户、多任务、支持多线程和多 CPU 的操作系统。

#Linux 能运行主要的 UNIX 工具软件、应用程序和网络协议。
#它支持 32 位和 64 位硬件。
#Linux 继承了 Unix 以网络为核心的设计思想，是一个性能稳定的多用户网络操作系统。

#Linux 的发行版
#Linux 的发行版说简单点就是将 Linux 内核与应用软件做一个打包。
#目前市面上较知名的发行版有：Ubuntu、RedHat、CentOS、Debian、Fedora、SuSE、OpenSUSE、Arch Linux、SolusOS 等。
#Linux 应用领域
#今天各种场合都有使用各种 Linux 发行版，从嵌入式设备到超级计算机，并且在服务器领域确定了地位，
#通常服务器使用 LAMP（Linux + Apache + MySQL + PHP）或 LNMP（Linux + Nginx+ MySQL + PHP）组合。
#目前 Linux 不仅在家庭与企业中使用，并且在政府中也很受欢迎。
#巴西联邦政府由于支持 Linux 而世界闻名。
#有新闻报道俄罗斯军队自己制造的 Linux 发布版的，做为 G.H.ost 项目已经取得成果。
#印度的 Kerala 联邦计划在向全联邦的高中推广使用 Linux。
#中华人民共和国为取得技术独立，在龙芯处理器中排他性地使用 Linux。
#在西班牙的一些地区开发了自己的 Linux 发布版，并且在政府与教育领域广泛使用
#葡萄牙同样使用自己的 Linux 发布版 Caixa Mágica，用于 Magalh?es 笔记本电脑和 e-escola 政府软件。
#法国和德国同样开始逐步采用 Linux。

#Linux vs Windows
#目前国内 Linux 更多的是应用于服务器上，而桌面操作系统更多使用的是 Windows。主要区别如下
#Linux
#界面
#图形界面风格依发布版不同而不同，可能互不兼容。
#GNU/Linux 的终端机是从 UNIX 传承下来，基本命令和操作方法也几乎一致。

#驱动程序
#由志愿者开发，由 Linux 核心开发小组发布，很多硬件厂商基于版权考虑并未提供驱动程序，
#但是在开源开发模式下，许多老硬件尽管在Windows下很难支持的也容易找到驱动。
#HP、Intel、AMD 等硬件厂商逐步不同程度支持开源驱动，问题正在得到缓解。

#使用
#图形界面使用简单，容易入门。文字界面，需要学习才能掌握。

#学习
#系统构造简单、稳定，且知识、技能传承性好，深入学习相对容易。

#软件
#大部分软件都可以自由获取，同样功能的软件选择较少。